{
  "documents": [
    {
      "id": 1,
      "name": "Tài liệu công cụ lập trình cơ bản.",
      "introduction": "Các công cụ và tài liệu cơ bản khi bước vào lập trình.",
      "links":[
        {"title":"code.visualstudio.com","description":"Visual studio code: là 1 trình soạn thảo code được nhiều người sử dụng nhất hiện nay với khả năng code được nhiều ngôn ngữ và rất nhiều extension hổ trợ cho việc code."},
        {"title":"postman.com","description":"Postman là một công ty phần mềm toàn cầu cung cấp nền tảng API để các nhà phát triển thiết kế, xây dựng, thử nghiệm và cộng tác trên API. Hơn 30 triệu người dùng đã đăng ký và 500.000 tổ chức đang sử dụng Postman."},
        {"title":"codelearn.io","description":"CodeLearn là nền tảng tương tác trực tuyến hỗ trợ người dùng học tập, thực hành, thi đấu và đánh giá kỹ năng lập trình một cách nhanh chóng và chính xác."},
        {"title":"fullstack.edu.vn","description":"Trang web hướng dẫn lập trình từ cơ bản đến các khóa nâng cao."},
        {"title":"www.w3schools.com","description":"Một trang web giáo dục cho việc học các công nghệ web trực tuyến."},
        {"title":"codewithantonio.com","description":"Là một youtuber, một senior dev chia sẽ các kiến thức về lập trình, đặc biệt là các project video khá tuyệt vời."},
        {"title":"www.freecodecamp.org","description":"FreeCodeCamp là một tổ chức giáo dục phi lợi nhuận bao gồm nền tảng web học tập tương tác, diễn đàn cộng đồng trực tuyến, phòng trò chuyện, ấn phẩm trực tuyến và các tổ chức địa phương có mục đích giúp mọi người có thể tiếp cận việc phát triển phần mềm học tập."},
        {"title":"roadmap.sh","description":"Xem xét các định hướng và các thứ cần phải học về 1 ngôn ngữ lập trình."},
        {"title":"www.codecademy.com","description":""}
      ],
      "type_id":4
    },

    {
      "id": 2,
      "name": "Framework - Nodejs",
      "introduction": "Đây là tất cả những thư viện, framework tôi đã dùng.",
      "links":[
        {"title":"nestjs.com","description":"NestJS là một framework mã nguồn mở để phát triển ứng dụng server-side (backend applications) bằng ngôn ngữ TypeScript hoặc JavaScript."},
        {"title":"expressjs.com","description":"Express.js, hay đơn giản là Express, là một khung ứng dụng web back end để xây dựng các API RESTful với Node.js, được phát hành dưới dạng phần mềm mã nguồn mở và miễn phí theo Giấy phép MIT. Nó được thiết kế để xây dựng các ứng dụng web và API. Nó đã được gọi là khung máy chủ tiêu chuẩn trên thực tế cho Node.js."},
        {"title":"vuejs.org","description":"Vue, là một framework linh động dùng để xây dựng giao diện người dùng. Khác với các framework nguyên khối, Vue được thiết kế từ đầu theo hướng cho phép và khuyến khích việc phát triển ứng dụng theo các bước."},
        {"title":"nextjs.org","description":"Next.js là một khung phát triển web mã nguồn mở do công ty tư nhân Vercel tạo ra, cung cấp các ứng dụng web dựa trên React với kết xuất phía máy chủ và tạo trang web tĩnh."}
      ],
      "type_id":3
    },

    {
      "id": 3,
      "name": "Cơ sở dữ liệu - Database",
      "introduction": "Đường dẫn tài liệu sử dụng cơ sở dữ liệu.",
      "links":[
        {"title":"www.w3schools.com/MySQL","description":"MySQL là hệ quản trị cơ sở dữ liệu tự do nguồn mở phổ biến nhất thế giới và được các nhà phát triển rất ưa chuộng trong quá trình phát triển ứng dụng."},
        {"title":"www.w3schools.com/sql","description":"Microsoft SQL Server là một hệ quản trị cơ sở dữ liệu quan hệ được phát triển bởi Microsoft. Là một máy chủ cơ sở dữ liệu, nó là một sản phẩm phần mềm có chức năng chính là lưu trữ và truy xuất dữ liệu theo yêu cầu của các ứng dụng phần mềm khác."},
        {"title":"learn.mongodb.com","description":"MongoDB là một hệ quản trị cơ sở dữ liệu NoSQL mã nguồn mở đa nền tảng viết bằng C++. Bản ghi trong MongoDB được lưu trữ dạng một dữ liệu văn bản, là một cấu trúc dữ liệu bao gồm các cặp giá trị và trường tương tự như các đối tượng JSON."},
        {"title":"redis.io","description":"Redis là một cơ sở dữ liệu phân tán trong bộ nhớ, được sử dụng như một cơ sở dữ liệu đệm lưu dữ liệu dạng cặp khóa-giá trị thông qua các message broker trong bộ nhớ, trong khoảng thời gian tùy chọn."},
        {"title":"typeorm.io","description":"TypeORM là một thư viện Object Relational Mapper chạy trong node. js và được viết bằng TypeScript. TypeScript là một cải tiến đối với JavaScript với kiểu gõ tùy chọn. TypeScript là một ngôn ngữ biên dịch."},
        {"title":"sequelize.org","description":"Sequelize là một thư viện phổ biến hỗ trợ ORM. Cũng như Query builder, sequelize hỗ trợ cùng lúc nhiều loại cơ sở dữ liệu khác nhau."}
     
      ],
      "type_id":1
    },

    
    {
      "id": 4,
      "name": "Ngôn ngữ lập trình",
      "introduction": "Đường dẫn tài liệu sử dụng ngôn ngữ lập trình.",
      "links":[
        {"title":"www.codecademy.com/learn/introduction-to-javascript","description":"JavaScript, theo phiên bản hiện hành, là một ngôn ngữ lập trình được phát triển từ các ý niệm nguyên mẫu. Ngôn ngữ này được dùng rộng rãi cho các trang web cũng như phía máy chủ."},
        {"title":"www.codecademy.com/learn/learn-typescript","description":"TypeScript là một ngôn ngữ lập trình được phát triển và duy trì bởi Microsoft. Nó là một siêu tập hợp cú pháp nghiêm ngặt của JavaScript và thêm tính năng kiểu tĩnh tùy chọn vào ngôn ngữ. TypeScript được thiết kế để phát triển các ứng dụng lớn và biên dịch sang JavaScript."},
        {"title":"fullstack.edu.vn/courses/html-css","description":"HTML là một ngôn ngữ đánh dấu được thiết kế ra để tạo nên các trang web trên World Wide Web. Nó có thể được trợ giúp bởi các công nghệ như CSS và các ngôn ngữ kịch bản giống như JavaScript"},
        {"title":"fullstack.edu.vn/courses/html-css","description":"Trong tin học, các tập tin định kiểu theo tầng – dịch từ tiếng Anh là Cascading Style Sheets – được dùng để miêu tả cách trình bày các tài liệu viết bằng ngôn ngữ HTML và XHTML. Ngoài ra ngôn ngữ định kiểu theo tầng cũng có thể dùng cho XML, SVG, XUL"}
      ],
      "type_id":2
    }

  ],

  "types":[
    {
      "id":1,
      "name":"Database",
      "title":"Cơ sở dữ liệu"
    },
    {
      "id":2,
      "name":"Language",
      "title":"Ngôn ngữ lập trình"
    },
    {
      "id":3,
      "name":"Framework",
      "title":"Thư viện | Framework"
    },
    {
      "id":4,
      "name":"Tool",
      "title":"Tài liệu | Công cụ"
    }
  ],

  "information": [
    {
      "id": 1,
      "name": "Nguyễn Minh Nhựt",
      "index": "Nodejs Development",
      "avatar": "https://scontent.fsgn2-4.fna.fbcdn.net/v/t39.30808-6/341607916_761594412207161_701151146353912051_n.jpg?_nc_cat=101&ccb=1-7&_nc_sid=6ee11a&_nc_ohc=NRe-iXiYFDsQ7kNvgHjms2D&_nc_ht=scontent.fsgn2-4.fna&oh=00_AYCDsPQMC2-18lUKFtyXLggZ6VPBWlWd_O9r-LJ56TeLKw&oe=66C9DEB0",
      "information": "Tôi là sinh viên tốt nghiệp với mục tiêu trở thành lập trình viên full-stack Node.js. Tôi có nền tảng về Node.js, Express.js và Nest.js cho backend, và thành thạo Vue.js, Vite và Tailwind CSS cho frontend. Ngoài ra, tôi có kỹ năng về các cơ sở dữ liệu như MySQL, SQL Server và MongoDB.",
      "github": "https://github.com/noobnhut/"
    }
  ],

  "skills": [
    {
      "id": 1,
      "name": "Javascript"
    },
    {
      "id": 2,
      "name": "Typescript"
    },
    {
      "id": 3,
      "name": "NodeJs"
    },
    {
      "id": 4,
      "name": "NestJs"
    },
    {
      "id": 5,
      "name": "MySQL"
    },
    {
      "id": 6,
      "name": "MongoDB"
    },
    {
      "id": 7,
      "name": "Prisma"
    },
    {
      "id": 8,
      "name": "Git"
    }
  ],
  
  "projects": [
    {
      "id": 1,
      "name": "Clone Ứng Dụng Discord",
      "link": "https://github.com/noobnhut/next_discord",
      "description": "Xây dựng một bản sao của ứng dụng Discord, nâng cao kỹ năng về Next.js, React, Socketio, Prisma, Tailwind và MySQL",
      "skills": [
        {
          "id": 1,
          "name": "Next.js"
        },
        {
          "id": 2,
          "name": "TailwindCSS"
        },
        {
          "id": 3,
          "name": "Shadcn/ui"
        },
        {
          "id": 4,
          "name": "MySQL"
        },
        {
          "id": 5,
          "name": "Prisma"
        },
        {
          "id": 6,
          "name": "SocketIO"
        },
        {
          "id": 7,
          "name": "Livekit"
        }
      ]
    },
    {
      "id": 2,
      "name": "Website Thương Mại Điện Tử",
      "duration": "4/2024 - 5/2024",
      "position": "Full-stack Developer",
      "description": "Phát triển một trang web mua sắm với các tính năng như mua hàng, xem và lưu sản phẩm yêu thích, thanh toán COD và thanh toán trực tuyến qua VNPay.",
      "skills": [
        {
          "id": 1,
          "name": "Vuejs"
        },
        {
          "id": 2,
          "name": "Vite"
        },
        {
          "id": 3,
          "name": "TailwindCSS"
        },
        {
          "id": 4,
          "name": "Node.js"
        },
        {
          "id": 5,
          "name": "Nest.js"
        },
        {
          "id": 6,
          "name": "TypeORM"
        },
        {
          "id": 7,
          "name": "MySQL"
        },
        {
          "id": 8,
          "name": "Cloudinary"
        },
        {
          "id": 9,
          "name": "VNPay"
        }
      ],
      "link": "https://github.com/noobnhut/vuejs_nestjs_ecom"
    },
    {
      "id": 3,
      "name": "Nền Tảng Trao Đổi Đồ Cũ",
      "duration": "6/2023 - 9/2023",
      "position": "Full-stack Developer, System Design Analyst",
      "description": "Tạo một nền tảng chia sẻ và trao đổi đồ cũ, với các chức năng đăng bài, tìm kiếm, thông báo ưu tiên và nhắn tin trực tiếp.",
      "skills": [
        {
          "id": 1,
          "name": "Vuejs"
        },
        {
          "id": 2,
          "name": "Vite"
        },
        {
          "id": 3,
          "name": "TailwindCSS"
        },
        {
          "id": 4,
          "name": "Mapbox"
        },
        {
          "id": 5,
          "name": "Node.js"
        },
        {
          "id": 6,
          "name": "Express.js"
        },
        {
          "id": 7,
          "name": "NodeCron"
        },
        {
          "id": 8,
          "name": "Socket.IO"
        },
        {
          "id": 9,
          "name": "Sequelize"
        },
        {
          "id": 10,
          "name": "MySQL"
        },
        {
          "id": 11,
          "name": "Mapbox"
        },
        {
          "id": 12,
          "name": "provinces.open-api.vn"
        }
      ],
      "link": "https://github.com/noobnhut/luanvan"
    }
  ]
}

 



